In [1]:
import pandas as pd

In [6]:
direct = 'names/'

In [8]:
def concat_df(years):
    stack = []
    for year in years:
        path = direct + 'yob' + str(year) + '.txt'
        df = pd.read_csv(path, names=['Name', 'Gender', 'Quantity'])
        df['Year'] = year
        stack.append(df)
    return pd.concat(stack)

In [9]:
def count_top3(years):
    df_conc = concat_df(years)
    df_res = df_conc.groupby(['Name']).sum()[['Quantity']]   
    return df_res.sort_values('Quantity', ascending=False).head(3)

In [10]:
top = count_top3([1900, 1950, 2000])
top

        Quantity
Name
James     111789
John      109601
Robert    101368

In [11]:
top2 = count_top3([1880])
top2

         Quantity
Name
John         9701
William      9562
Mary         7092

In [23]:
def count_dynamic(years):
    df_conc = concat_df(years)
    return df_conc.groupby(['Gender', 'Year']).sum()[['Quantity']]

In [24]:
dynamic = count_dynamic([1900, 1950, 2000])
dynamic

             Quantity
Gender Year
F      1900    299798
       1950   1713065
       2000   1815295
M      1900    150480
       1950   1790437
       2000   1963202